# 第五章 Pandas入门

**Pandas 的数据结构**

## Series

是一种类似于一维数组的对象，由一组数据和一组与之相关的数据标签（索引）组成

In [2]:
import pandas as pd
from pandas import Series,DataFrame
obj = Series([4,7,-5,4])
obj

0    4
1    7
2   -5
3    4
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  4], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

一般地我们可以设定其数据点的索引

In [7]:
obj2 = Series([4,7,5,-2],index = ["d","v","a","c"])
obj2

d    4
v    7
a    5
c   -2
dtype: int64

和一般的 Numpy 数组相比较，可以按照索引来进行单个或者一组值得选取

In [8]:
obj2["a"]

5

In [12]:
obj2[["c","a","d"]]

c   -2
a    5
d    4
dtype: int64

Numpy 的数组运算也会保留索引和值之间的链接

我们可以将 Series 看成一个定长的有序字典，因为其实索引值到数据值的一个映射。可以用在许多原本需要字典参数的函数中：

In [14]:
"b" in obj2

False

也可以通过字典来创建 Series

In [17]:
sdata = {"Texas":71000,"Oregon":16000}
obj3 = Series(sdata)
obj3

Oregon    16000
Texas     71000
dtype: int64

In [19]:
states = ["California","ohio","Texas","Oregon"]
obj4 = Series(sdata, index = states)
obj4

California        NaN
ohio              NaN
Texas         71000.0
Oregon        16000.0
dtype: float64

如果传入索引，其中缺失的值会表示为 NaN

可以使用 isnull 和 notnull 检测缺失数据

In [20]:
pd.isnull(obj4)

California     True
ohio           True
Texas         False
Oregon        False
dtype: bool

In [21]:
pd.notnull(obj4)

California    False
ohio          False
Texas          True
Oregon         True
dtype: bool

对于诸多应用场景而言， Series 的一个主要的功能是

**在算术运算中会自动对齐不同索引的数据**

In [24]:
obj3

Oregon    16000
Texas     71000
dtype: int64

In [25]:
obj4

California        NaN
ohio              NaN
Texas         71000.0
Oregon        16000.0
dtype: float64

In [26]:
obj3  + obj4

California         NaN
Oregon         32000.0
Texas         142000.0
ohio               NaN
dtype: float64

另外可以对 Series 对象本身和其索引设置 name 属性，另外其索引可以通过赋值的方式就地修改

In [27]:
obj4.name = "population"
obj4.index.name = "state"
obj4

state
California        NaN
ohio              NaN
Texas         71000.0
Oregon        16000.0
Name: population, dtype: float64

In [29]:
obj.index = ["bob","steve","jeff","ryan"]
obj

bob      4
steve    7
jeff    -5
ryan     4
dtype: int64

## DataFrame
DataFrame 是一个表格型的数据结构，其含有一组有序的列，每列可以是不同种类的值类型（数值、字符串或者布尔值等）。

DataFrame 既有行索引也有列索引，可以看出是由 Series 组成的字典（共用了一个索引）。

其对于列和行的操作基本是平衡的，而其数据也是按照一个或者多个二维块存放的。

创建方法，一种是直接传入一个等长列表或数组组成的字典

In [30]:
data = { "state":["ohio","Nevda","ohio"],
        "year":[2000,2001,2000],
        "pop":[1.5,1.6,1.9]
}
frame = DataFrame(data)
frame

   pop  state  year
0  1.5   ohio  2000
1  1.6  Nevda  2001
2  1.9   ohio  2000

可以指定列的序列

In [31]:
DataFrame(data,columns = ["year","state","pop"])

   year  state  pop
0  2000   ohio  1.5
1  2001  Nevda  1.6
2  2000   ohio  1.9

In [48]:
frame2 = DataFrame(data,columns = ["year","state","pop","debt"],index =
         ["one","two","three"])
frame2

       year  state  pop debt
one    2000   ohio  1.5  NaN
two    2001  Nevda  1.6  NaN
three  2000   ohio  1.9  NaN

In [36]:
frame2.columns

Index(['year', 'state', 'pop'], dtype='object')

可以使用字典标记或者属性的方式，将 DataFrame 的列获取成一个 Series

In [38]:
frame2["year"]

one      2000
two      2001
three    2000
Name: year, dtype: int64

In [40]:
frame2.year

one      2000
two      2001
three    2000
Name: year, dtype: int64

行可通过位置或者名称的方式进行索引，如

In [47]:
frame2.ix["three"]

year     2000
state    ohio
pop       1.9
Name: three, dtype: object

列可以通过赋值的方式进行修改

In [51]:
frame2["debt"] = 16.6
frame2

       year  state  pop  debt
one    2000   ohio  1.5  16.6
two    2001  Nevda  1.6  16.6
three  2000   ohio  1.9  16.6

In [58]:
import numpy as np
frame2["debt"] = np.arange(3.)
frame2

       year  state  pop  debt
one    2000   ohio  1.5   0.0
two    2001  Nevda  1.6   1.0
three  2000   ohio  1.9   2.0

将列表或者数组赋值给某个列时，其长度必须匹配

如果赋值的是一个 Series,会精确匹配 DataFrame 的索引，所有的空位会被填上缺失值

In [61]:
val = Series([-1.2,-3.4],index = ["three","two"])
frame2["debt"] = val
frame2

       year  state  pop  debt
one    2000   ohio  1.5   NaN
two    2001  Nevda  1.6  -3.4
three  2000   ohio  1.9  -1.2

del 可以删除列

In [62]:
frame2["eastern"] = frame2.state == "Ohio"
frame2

       year  state  pop  debt  eastern
one    2000   ohio  1.5   NaN    False
two    2001  Nevda  1.6  -3.4    False
three  2000   ohio  1.9  -1.2    False

In [63]:
del frame2["eastern"]
frame2

       year  state  pop  debt
one    2000   ohio  1.5   NaN
two    2001  Nevda  1.6  -3.4
three  2000   ohio  1.9  -1.2

**注意**

通过索引方式返回的列只是相应数据的视图而不是副本，所以对于返回的 Series 所进行的任何就地修改会反映到原来的 DataFrame 上。

可以通过 Series 的 copy 方法显式地复制列

对于嵌套的字典传入 DataFrame 将会把外层字典的键作为列，内层键则作为行索引

In [64]:
pop = {'Nevada':{2001:2.4,2002:2.9},
       "Ohio":{2000:1.5,2002:3.6,2001:3.7}
      }
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   3.7
2002     2.9   3.6

可以对结果进行转置

In [65]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   3.7   3.6

其中，内层字典的键会被合并、排序以形成最终的索引。而如果显示地指定了索引，就不会如此

In [66]:
DataFrame(pop,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   3.7
2002     2.9   3.6
2003     NaN   NaN

**索引对象**

pandas 的索引对象用于管理轴标签和其他元数据。

在构建 Series 或者 DataFrame 的时候，所用到的任何数组或其他序列的标签都会被转换成一个 Index

In [68]:
obj = Series(range(3),index = ['a','b','c'])
index = obj.index
index[1:]

Index(['b', 'c'], dtype='object')

注意， index 对象是**不可修改的**，这使得 Index 对象可以在多个数据结构之间安全共享

### 基本功能
**重新索引**

pandas 对象的一个重要方法是 reindex , 其作用是创建一个适应新索引的新对象

In [72]:
obj = Series([4.5,7.8,-4.8,5.7],index=['d','b','a','c'])
obj

d    4.5
b    7.8
a   -4.8
c    5.7
dtype: float64

In [74]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -4.8
b    7.8
c    5.7
d    4.5
e    NaN
dtype: float64

In [75]:
obj.reindex(['a','b','c','d','e'],fill_value = 0)

a   -4.8
b    7.8
c    5.7
d    4.5
e    0.0
dtype: float64

对于时间线序列这样的有序数据，重新索引可能需要做一些插值处理 method 选项可以实现

比如 ffill 可以实现向前填充

In [77]:
obj3 = Series(['blue','perple','yelow'],index = [0,2,4])
obj3

0      blue
2    perple
4     yelow
dtype: object

In [78]:
obj3.reindex(range(6),method = 'ffill')

0      blue
1      blue
2    perple
3    perple
4     yelow
5     yelow
dtype: object

对于 DataFrame reindex 可以修改行、列

In [83]:
frame = DataFrame(np.arange(9).reshape((3,3)),
                                      index = ['a','c','d'],
                 columns=['ohio','Texas','California'])
frame

   ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [84]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [87]:
states = ['Texas','Utah','California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [89]:
frame.reindex(index = ['a','b','c','d'],method = 'ffill',
             columns = states)

   Texas  Utah  California
a      1     0           2
b      1     0           2
c      4     3           5
d      7     6           8

In [91]:
frame.ix[['a','b','c','d'],states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

ix 功能似乎已经修改

[http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html]

**丢弃指定轴上的项**

In [92]:
data = DataFrame(np.arange(16).reshape((4,4)),
                index = ['Ohio','Colorado','Utah','New York'],
                columns = ['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [93]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [94]:
data.drop(['two','four'],axis = 1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

**索引、选取和过滤**

Series 索引的工作方式和 Numpy 数组相似，只是其索引值不是整数

但是，其利用标签的切片操作和普通的 Python 切片不同，**其末端是包含的**

In [95]:
obj = Series(np.arange(4.),index = ['a','b','c','d'])
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [96]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

而对于 DataFrame 进行索引就是获取一个或者多个列

In [97]:
data = DataFrame(np.arange(16).reshape((4,4)),
                index = ['Ohio','Colorado','Utah','New York'],
                columns = ['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [98]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

还可以通过切片或布尔型数组选取行

In [99]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [100]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

引入 ix 对行进行索引

In [102]:
data.ix['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [103]:
data.ix[['Colorado'],[3,0,1]]

          four  one  two
Colorado     7    4    5

In [104]:
data.ix[0]

one      0
two      1
three    2
four     3
Name: Ohio, dtype: int32

In [105]:
data.ix[:'Utah','two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [106]:
data.ix[data.three > 5,:3]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

**算术运算和数据对齐**

pandas 一个很有用的功能就是可以对不同索引对象进行算术运算。

在将对象相加时，如果存在不同的索引对，结果的索引就是索引对的并

In [111]:
s1 = Series([4.5,5.6,7.8],index=['a','c','e'])
s1

a    4.5
c    5.6
e    7.8
dtype: float64

In [112]:
s2 = Series([-2.1,3.4,5.6,5.9],index=['a','e','f','g'])
s2

a   -2.1
e    3.4
f    5.6
g    5.9
dtype: float64

In [113]:
s1+s2

a     2.4
c     NaN
e    11.2
f     NaN
g     NaN
dtype: float64

对于 DataFrame 对齐则会同时发生在行和列上

在不同索引对象进行运算是，可以在当一个对象中某个轴标签在另外一个对象中找不到时填充一个特殊值

In [114]:
df1 = DataFrame(np.arange(12.).reshape((3,4)),
               columns=list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [115]:
df2 = DataFrame(np.arange(20.).reshape((4,5)),
               columns=list('abcde'))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [116]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [117]:
df1.add(df2,fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [119]:
df1.reindex(columns = df2.columns,fill_value = -1)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0 -1
1  4.0  5.0   6.0   7.0 -1
2  8.0  9.0  10.0  11.0 -1

**DataFrame 和 Series 之间的运算**

**Broadcasting**

默认情况下，算术运算会将 Series 的索引匹配到 DataFrame 的列，然后向下传播

In [124]:
arr = np.arange(12.0).reshape((3,4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [125]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [128]:
data = DataFrame(np.arange(16).reshape((4,4)),
                index = ['Ohio','Colorado','Utah','New York'],
                columns = ['one','two','three','four'])
frame

   ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [131]:
s = data.iloc[0]
s

one      0
two      1
three    2
four     3
Name: Ohio, dtype: int32

In [132]:
data - s

          one  two  three  four
Ohio        0    0      0     0
Colorado    4    4      4     4
Utah        8    8      8     8
New York   12   12     12    12

In [133]:
s = data['one']
s

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

In [134]:
data.sub(s,axis=0)

          one  two  three  four
Ohio        0    1      2     3
Colorado    0    1      2     3
Utah        0    1      2     3
New York    0    1      2     3

这是我们设定其按照行索引进行传播的结果

**函数应用和映射**

numpy 中的元素级数组方法可以用于pandas对象

In [136]:
data = DataFrame(np.arange(16).reshape((4,4)),
                index = ['Ohio','Colorado','Utah','New York'],
                columns = ['one','two','three','four'])
np.sqrt(data)

               one       two     three      four
Ohio      0.000000  1.000000  1.414214  1.732051
Colorado  2.000000  2.236068  2.449490  2.645751
Utah      2.828427  3.000000  3.162278  3.316625
New York  3.464102  3.605551  3.741657  3.872983

有一个常用的操作是，将函数应用到各列或行所形成的一维数组上

采用 DataFrame 的 apply 方法可以实现

In [137]:
f = lambda x : x.max() - x.min()
data.apply(f)

one      12
two      12
three    12
four     12
dtype: int64

In [138]:
data.apply(f,axis=1)

Ohio        3
Colorado    3
Utah        3
New York    3
dtype: int64

还可以定义函数

In [139]:
def f(x):
    return Series([x.min(),x.max()],index=['min','max'])

data.apply(f)

     one  two  three  four
min    0    1      2     3
max   12   13     14    15

如果要使用元素级的函数，使用 applymap即可

In [140]:
format = lambda x : '%.2f' %x
data.applymap(format)

            one    two  three   four
Ohio       0.00   1.00   2.00   3.00
Colorado   4.00   5.00   6.00   7.00
Utah       8.00   9.00  10.00  11.00
New York  12.00  13.00  14.00  15.00

**排序和排名**

对行或者列索引进行排序（字典顺序），可以采用 sort_index 方法，将返回一个已经排序的新对象

In [141]:
obj = Series(range(4),index=['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

对于 DataFrame 则可以根据任何一个轴上的索引进行排序

In [142]:
frame = DataFrame(np.arange(8).reshape((2,4)),index = ['three','one'],
                 columns=['d','a','b','c']
                 )
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [143]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

默认是按照升序排列，可以设定为降序

In [145]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

在 DataFrame 中想要按照一个或者多个列中的值进行排序，传递名字给 by 选项即可

In [152]:
frame = DataFrame({'b':[4,-7,2],'a':[0,1,1]})
frame

   a  b
0  0  4
1  1 -7
2  1  2

In [154]:
frame.sort_values(by='b')

   a  b
1  1 -7
2  1  2
0  0  4

In [155]:
frame.sort_values(by=['a','b'])

   a  b
0  0  4
1  1 -7
2  1  2

**带有重复值的轴索引**

许多函数都要求标签唯一，但是这个不强制

In [157]:
obj = Series(range(5),index=['a','a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [158]:
obj.index.is_unique

False

In [159]:
obj['a']

a    0
a    1
dtype: int32

**汇总和计算描述统计**

pandas对象很多数学方法都假设没有缺失数据

In [160]:
df = DataFrame([[1.4,np.nan],[7.1,-4.5],
               [np.nan,np.nan],[0.75,0.75]],index=list('abcd'),
               columns=['one','two'])
df

    one   two
a  1.40   NaN
b  7.10 -4.50
c   NaN   NaN
d  0.75  0.75

In [161]:
df.sum()

one    9.25
two   -3.75
dtype: float64

In [162]:
df.sum(axis=1)

a    1.4
b    2.6
c    0.0
d    1.5
dtype: float64

NA 值会被自动排除，除非整个切片都是 NA

skipna 选项可以禁用该功能

In [163]:
df.mean(axis=1,skipna=False)

a     NaN
b    1.30
c     NaN
d    0.75
dtype: float64

有的方法可以返回间接统计，有的是累计型的

In [164]:
df.idxmax()

one    b
two    d
dtype: object

In [165]:
df.cumsum()

    one   two
a  1.40   NaN
b  8.50 -4.50
c   NaN   NaN
d  9.25 -3.75

有的既不是约简也不是累计

In [166]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -1.875000
std    3.493685  3.712311
min    0.750000 -4.500000
25%    1.075000 -3.187500
50%    1.400000 -1.875000
75%    4.250000 -0.562500
max    7.100000  0.750000

这是生成一次性的多个汇总统计

对于非数值数据，也是类似

In [168]:
obj = Series(['a','b','a','v']*4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

**相关系数和协方差**

使用 corr 和 cov 方法

**唯一值、值计数和成员资格**

可以从一维的 Series 中抽取信息

In [169]:
obj = Series(['c','a','d','b','b'])
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [170]:
obj.value_counts()

b    2
d    1
c    1
a    1
dtype: int64

注意 values_counts 可以用于任何数组和序列

In [171]:
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3     True
4     True
dtype: bool

**处理缺失数据**

In [173]:
from numpy import nan as NA
data = Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [175]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

对 DataFrame 默认 dropna 丢弃含有缺失值的行

In [181]:
data = DataFrame([[1,6.6,3],[1,NA,NA],[NA,6,7]])
data

     0    1    2
0  1.0  6.6  3.0
1  1.0  NaN  NaN
2  NaN  6.0  7.0

In [185]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.6  3.0

In [186]:
data.dropna(how="all")

     0    1    2
0  1.0  6.6  3.0
1  1.0  NaN  NaN
2  NaN  6.0  7.0

In [187]:
data[4] = NA
data.dropna(axis=1,how="all")

     0    1    2
0  1.0  6.6  3.0
1  1.0  NaN  NaN
2  NaN  6.0  7.0

**填充缺失数据**

In [191]:
df = DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0 -0.662009       NaN       NaN
1  2.090591       NaN       NaN
2  0.677489       NaN -0.759140
3  0.251250       NaN -0.315502
4  0.395714  0.052845  0.297181
5  0.830534 -0.484606  0.438123
6  2.235128 -0.721953 -0.886738

In [192]:
df.fillna(0)

          0         1         2
0 -0.662009  0.000000  0.000000
1  2.090591  0.000000  0.000000
2  0.677489  0.000000 -0.759140
3  0.251250  0.000000 -0.315502
4  0.395714  0.052845  0.297181
5  0.830534 -0.484606  0.438123
6  2.235128 -0.721953 -0.886738

In [193]:
df.fillna({1:0.5,2:-1})

          0         1         2
0 -0.662009  0.500000 -1.000000
1  2.090591  0.500000 -1.000000
2  0.677489  0.500000 -0.759140
3  0.251250  0.500000 -0.315502
4  0.395714  0.052845  0.297181
5  0.830534 -0.484606  0.438123
6  2.235128 -0.721953 -0.886738

## 层次化索引
使得我们可以在一个轴上拥有多个索引级别，使得我们可以能够用低维度形式处理高维度数据

In [194]:
data = Series(np.random.randn(10),index=
             [list('aaabbbccdd'),
                 [1,2,3,1,2,3,1,2,2,3]
             ])
data

a  1    0.555375
   2   -0.273141
   3    0.289252
b  1   -0.182747
   2   -0.565675
   3    1.318642
c  1    0.796749
   2    0.729679
d  2    0.424499
   3    0.106632
dtype: float64

In [195]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [196]:
data['b']

1   -0.182747
2   -0.565675
3    1.318642
dtype: float64

In [197]:
data['b':'c']

b  1   -0.182747
   2   -0.565675
   3    1.318642
c  1    0.796749
   2    0.729679
dtype: float64

In [201]:
data.ix[['b','d']]

b  1   -0.182747
   2   -0.565675
   3    1.318642
d  2    0.424499
   3    0.106632
dtype: float64

In [202]:
data[:,2]

a   -0.273141
b   -0.565675
c    0.729679
d    0.424499
dtype: float64

层次化索引在数据重塑和基于分组的操作中扮演着很重要的角色

比如这里可以重新安排到一个 DataFrame 中

In [203]:
data.unstack()

          1         2         3
a  0.555375 -0.273141  0.289252
b -0.182747 -0.565675  1.318642
c  0.796749  0.729679       NaN
d       NaN  0.424499  0.106632

In [204]:
data.unstack().stack()

a  1    0.555375
   2   -0.273141
   3    0.289252
b  1   -0.182747
   2   -0.565675
   3    1.318642
c  1    0.796749
   2    0.729679
d  2    0.424499
   3    0.106632
dtype: float64

**重排分级顺序**

swaplevel

**根据级别汇总统计**

**使用DataFrame 的列**

经常想要将其中的一个或者多个列当做列索引来用，或者将行索引变成列

In [205]:
frame = DataFrame({'a':range(7),'b':range(7,0,-1),
                   'c':['o','o','o','w','w','w','w'],
                   'd':[0,1,2,0,1,2,3]}
                 )
frame

   a  b  c  d
0  0  7  o  0
1  1  6  o  1
2  2  5  o  2
3  3  4  w  0
4  4  3  w  1
5  5  2  w  2
6  6  1  w  3

In [208]:
frame2 = frame.set_index(['c','d'])
frame2

     a  b
c d
o 0  0  7
  1  1  6
  2  2  5
w 0  3  4
  1  4  3
  2  5  2
  3  6  1

In [209]:
frame.set_index(['c','d'],drop=False)

     a  b  c  d
c d
o 0  0  7  o  0
  1  1  6  o  1
  2  2  5  o  2
w 0  3  4  w  0
  1  4  3  w  1
  2  5  2  w  2
  3  6  1  w  3

In [210]:
frame2.reset_index()

   c  d  a  b
0  o  0  0  7
1  o  1  1  6
2  o  2  2  5
3  w  0  3  4
4  w  1  4  3
5  w  2  5  2
6  w  3  6  1

**其他**

整数索引

面板数据